Repository: michael-hawker/XamlBehaviors
Catalog: src/BehaviorsSDKManaged/Microsoft.Xaml.Interactivity/MultilingualResources/Microsoft.Xaml.Interactivity.*.xlf
Languages: de_de, es_es, it_it, ja_jp, uk_ua, zh_tw

# CallMethodActionValidMethodNotFoundExceptionMessage
source: Cannot find method named {0} on object of type {1} that matches the expected signature.
de_de: Keine Methode mit der Bezeichnung {0} im Objekt vom Typ {1} gefunden, die mit der erwarteten Signatur übereinstimmt.
es_es: No se puede encontrar el método denominado {0} en el objeto de tipo {1} que coincida con la signatura esperada.
it_it: Impossibile trovare il metodo denominato {0} in un oggetto di tipo {1} corrispondente alla firma prevista.
ja_jp: メソッド {0} が、期待される署名と一致する型 {1} のオブジェクトにありません。
uk_ua: Неможливо знайти метод з ім'ям {0} в об'єкті типу {1}, який відповідав би очікуваному підпису.
zh_tw: 在類型 {1} 的物件上找不到符合預期的簽章且名稱為 {0} 的方法。

# CannotAttachBehaviorMultipleTimesExceptionMessage
source: An instance of a behavior cannot be attached to more than one object at a time.
de_de: Eine Instanz eines Verhaltens kann nicht mehreren Objekten gleichzeitig angefügt werden.
es_es: No se puede adjuntar una instancia de Behavior a más de un objeto simultáneamente.
it_it: Impossibile associare l'istanza di un comportamento a più di un oggetto alla volta.
ja_jp: ビヘイビアーのインスタンスは、1 度に複数のオブジェクトに追加することはできません。
uk_ua: Неможливо прикріпити екземпляр поведінки до декількох об'єктів одночасно.
zh_tw: 無法一次將行為執行個體附加到多個物件。

# CannotFindEventNameExceptionMessage
source: Cannot find an event named {0} on type {1}.
de_de: Kein Ereignis mit der Bezeichnung {0} auf Typ {1} gefunden.
es_es: No se puede encontrar un evento con el nombre {0} en el tipo {1}.
it_it: Impossibile trovare un evento denominato {0} nel tipo {1}.
ja_jp: 名前が {0} (型 {1}) のイベントが見つかりません。
uk_ua: Неможливо знайти подію з ім'ям {0} в типі {1}.
zh_tw: 在類型 {1} 上找不到名稱為 {0} 的事件。

# ChangePropertyActionCannotFindPropertyNameExceptionMessage
source: Cannot find a property named {0} on type {1}.
de_de: Keine Eigenschaft mit der Bezeichnung {0} auf Typ {1} gefunden.
es_es: No se puede encontrar una propiedad con el nombre {0} en el tipo {1}.
it_it: Impossibile trovare una proprietà denominata {0} nel tipo {1}.
ja_jp: 名前が {0} (型 {1}) のプロパティが見つかりません。
uk_ua: Неможливо знайти властивість з ім'ям {0} в типі {1}.
zh_tw: 在類型 {1} 上找不到名稱為 {0} 的屬性。

# ChangePropertyActionCannotSetValueExceptionMessage
source: Cannot assign value of type {0} to property {1} of type {2}. The {1} property can be assigned only values of type {2}.
de_de: Kann keinen Wert vom Typ {0} zu einer Eigenschaft {1} vom Typ {2} zuweisen. Die Eigenschaft {1} kann nur Werten vom Typ {2} zugewiesen werden.
es_es: No se puede asignar un valor del tipo {0} a la propiedad {1} del tipo {2}. A la propiedad {1} solo se le pueden asignar valores del tipo {2}.
it_it: Impossibile assegnare un valore di tipo {0} alla proprietà {1} di tipo {2}. Alla proprietà {1} possono essere assegnati solo valori di tipo {2}.
ja_jp: 型 {0} の値をプロパティ {1} (型 {2}) に割り当てることができません。{1} プロパティは、型 {2} の値にのみ割り当てることができます。
uk_ua: Неможливо призначити значення типу {0} властивості {1} типу {2}. Властивості {1} можна призначити тільки значення типу {2}.
zh_tw: 無法將類型 {0} 的值指派給類型 {2} 的屬性 {1}。只有類型 {2} 的值能夠指派給 {1} 屬性。

# ChangePropertyActionPropertyIsReadOnlyExceptionMessage
source: Property {0} defined by type {1} does not expose a set method and therefore cannot be modified.
de_de: Die vom Typ {1} definierte Eigenschaft {0} gibt keine Methode zum Festlegen an und kann daher nicht geändert werden.
es_es: La propiedad {0} definida por el tipo {1} no expone un método establecido y, por lo tanto, no se puede modificar.
it_it: La proprietà {0} definita dal tipo {1} non espone un metodo set. Impossibile modificarla.
ja_jp: プロパティ {0} (型 {1} で定義) は、set メソッドを提示していないため、修正できません。
uk_ua: Властивість {0}, яке визначається типом {1}, не надає заданий метод і, отже, не може бути змінено.
zh_tw: 類型 {1} 所定義的屬性 {0} 未公開 set 方法，因此無法修改。

# EventNotSupportedExceptionMessage
source: Event {0} is not supported. Consider implementing a custom IBehavior to respond to this event.
de_de: Ereignis {0} ist nicht unterstützt. Erwägen Sie die Implementierung eines benutzerdefinierten IBehavior, um auf dieses Ereignis zu reagieren.
es_es: No se admite el evento {0}. Considere implementar un IBehavior personalizado para responder a este evento.
it_it: L'evento {0} non è supportato. Implementare un elemento IBehavior personalizzato per rispondere a questo evento.
ja_jp: イベント {0} はサポートされていません。カスタム IBehavior を実装して、このイベントに応答することを検討してください。
uk_ua: Подія {0} не підтримується. Для відгуку на дану подію рекомендується реалізувати користувальницьку поведінку IBehavior.
zh_tw: 不支援事件 {0}。請考慮實作自訂的 IBehavior 以回應這個事件。

# GoToStateActionTargetHasNoStateGroups
source: Target {0} does not define any VisualStateGroups.
de_de: Das Ziel {0} definiert keine VisualStateGroups.
es_es: El destino {0} no define ningún objeto VisualStateGroup.
it_it: La destinazione {0} non definisce VisualStateGroups.
ja_jp: ターゲット {0} は、VisualStateGroups を一切定義していません。
uk_ua: Цільовий об'єкт {0} не визначає ніяких груп VisualStateGroups.
zh_tw: 目標 {0} 未定義任何 VisualStateGroups。

# InvalidLeftOperand
source: Binding property of type {0} cannot be used with operator {1}.
de_de: Die Bindungseigenschaft vom Typ {0} kann nicht mit dem Operator {1} verwendet werden.
es_es: La propiedad Binding del tipo {0} no se puede usar con el operador {1}.
it_it: Impossibile utilizzare la proprietà Binding di tipo {0} con l'operatore {1}.
ja_jp: 型 {0} の Binding プロパティは、演算子 {1} と共に使用できません。
uk_ua: Властивість прив'язки типу {0} неможливо використовувати з оператором {1}.
zh_tw: 類型 {0} 的 Binding 屬性無法搭配運算子 {1} 一起使用。

# InvalidOperands
source: Binding property of type {0} and Value property of type {1} cannot be used with operator {2}.
de_de: Die Bindungseigenschaft vom Typ {0} und die Werteigenschaft vom Typ {1} können nicht mit dem Operator {2} verwendet werden.
es_es: La propiedad Binding del tipo {0} y la propiedad Value del tipo {1} no se pueden usar con el operador {2}.
it_it: Impossibile utilizzare la proprietà Binding di tipo {0} e la proprietà Value di tipo {1} con l'operatore {2}.
ja_jp: 型 {0} の Binding プロパティと型 {1} の Value プロパティは、演算子 {2} と共に使用できません。
uk_ua: Властивість прив'язки типу {0} і властивість значення типу {1} неможливо використовувати з оператором {2}.
zh_tw: 類型 {0} 的 Binding 屬性和類型 {1} 的 Value 屬性無法搭配運算子 {2} 一起使用。

# InvalidRightOperand
source: Value property of type {0} cannot be used with operator {1}.
de_de: Die Werteigenschaft vom Typ {0} kann nicht mit dem Operator {1} verwendet werden.
es_es: La propiedad Value del tipo {0} no se puede usar con el operador {1}.
it_it: Impossibile utilizzare la proprietà Value di tipo {0} con l'operatore {1}.
ja_jp: 型 {0} の Value プロパティは、演算子 {1} と共に使用できません。
uk_ua: Властивість значення типу {0} неможливо використовувати з оператором {1}.
zh_tw: 類型 {0} 的 Value 屬性無法搭配運算子 {1} 一起使用。

# DuplicateBehaviorInCollectionExceptionMessage
source: Cannot add an instance of a behavior to a BehaviorCollection more than once.
de_de: Eine Instanz eines Verhaltens kann einer BehaviorCollection höchstens einmal hinzugefügt werden.
es_es: No se puede agregar una instancia de Behavior a un BehaviorCollection más de una vez.
it_it: Impossibile aggiungere l'istanza di un comportamento a BehaviorCollection più di una volta.
ja_jp: ビヘイビアーのインスタンスを BehaviorCollection に複数回追加することはできません。
uk_ua: Неможливо додати екземпляр поведінки в колекцію BehaviorCollection більше одного разу.
zh_tw: 無法重複將行為執行個體加到 BehaviorCollection。

# NonActionAddedToActionCollectionExceptionMessage
source: Only IAction types are supported in an ActionCollection.
de_de: Nur IAction-Typen werden in einer ActionCollection unterstützt.
es_es: Solo se admiten tipos IAction en ActionCollection.
it_it: Solo i tipi IAction sono supportati in ActionCollection.
ja_jp: ActionCollection では IAction 型のみサポートされます。
uk_ua: В колекції ActionCollection підтримуються тільки типи Action.
zh_tw: ActionCollection 只支援 IAction 類型。

# NonBehaviorAddedToBehaviorCollectionExceptionMessage
source: Only IBehavior types are supported in a BehaviorCollection.
de_de: Nur IBehavior-Typen werden in einer BehaviorCollection unterstützt.
es_es: Solo se admiten tipos IBehavior en BehaviorCollection.
it_it: Solo i tipi IBehavior sono supportati in BehaviorCollection.
ja_jp: BehaviorCollection では IBehavior 型のみサポートされます。
uk_ua: В колекції BehaviorCollection підтримуються тільки типи Behavior.
zh_tw: BehaviorCollection 只支援 IBehavior 類型。
